
#include <stdio.h>

int value; //объявление целочисленной глобальной переменной
double big_pi; //объявление вещественной глобальной переменной двойной точности
int main()
{
    int a; //объявление целочисленной переменной
    float f; //объявление вещественной переменной
    int su7, prime = 7, five = 5; //объявление переменных с инициализацией
    float pi = 3.14; //объявление переменных с инициализацией
    char c, c2 = 'A', m = 10; //объявление символьных переменных с инициализацией
    printf("hello");
}
